In [2]:
import pandas as pd
import numpy as np

# pandas 주요 내장함수
# pandas 변수 생성
# Series 변수 : 1차원
df = pd.Series([1,2,3,4,5])
print(df)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
# DataFram : 2차원
a = np.arange(1,51).reshape(10,5)
print(a)
print(type(a))
df = pd.DataFrame(a)
print(df)

[[ 1  2  3  4  5]
 [ 6  7  8  9 10]
 [11 12 13 14 15]
 [16 17 18 19 20]
 [21 22 23 24 25]
 [26 27 28 29 30]
 [31 32 33 34 35]
 [36 37 38 39 40]
 [41 42 43 44 45]
 [46 47 48 49 50]]
<class 'numpy.ndarray'>
    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25
5  26  27  28  29  30
6  31  32  33  34  35
7  36  37  38  39  40
8  41  42  43  44  45
9  46  47  48  49  50

In [7]:
# 변수형 및 데이터 확인/탐색
# dtypes
print(df.dtypes)

0    int32
1    int32
2    int32
3    int32
4    int32
dtype: object

In [9]:
# head
print(df.head())
print(df.head(3))

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25
    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15

In [10]:
# tail
print(df.tail())
print(df.tail(3))

    0   1   2   3   4
5  26  27  28  29  30
6  31  32  33  34  35
7  36  37  38  39  40
8  41  42  43  44  45
9  46  47  48  49  50
    0   1   2   3   4
7  36  37  38  39  40
8  41  42  43  44  45
9  46  47  48  49  50

In [15]:
# index
print(df)
print(df.index)

# columns
print(df.columns)

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25
5  26  27  28  29  30
6  31  32  33  34  35
7  36  37  38  39  40
8  41  42  43  44  45
9  46  47  48  49  50
RangeIndex(start=0, stop=10, step=1)
RangeIndex(start=0, stop=5, step=1)

In [17]:
# describe : 기술통계
df.describe()

               0          1          2          3          4
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean   23.500000  24.500000  25.500000  26.500000  27.500000
std    15.138252  15.138252  15.138252  15.138252  15.138252
min     1.000000   2.000000   3.000000   4.000000   5.000000
25%    12.250000  13.250000  14.250000  15.250000  16.250000
50%    23.500000  24.500000  25.500000  26.500000  27.500000
75%    34.750000  35.750000  36.750000  37.750000  38.750000
max    46.000000  47.000000  48.000000  49.000000  50.000000

In [25]:
# 변수형 및 데이터 변형
print(df)
a = df.to_numpy()
print(a)

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25
5  26  27  28  29  30
6  31  32  33  34  35
7  36  37  38  39  40
8  41  42  43  44  45
9  46  47  48  49  50
[[ 1  2  3  4  5]
 [ 6  7  8  9 10]
 [11 12 13 14 15]
 [16 17 18 19 20]
 [21 22 23 24 25]
 [26 27 28 29 30]
 [31 32 33 34 35]
 [36 37 38 39 40]
 [41 42 43 44 45]
 [46 47 48 49 50]]

In [27]:
# sort_values
print(df)
df.sort_values(by=2, ascending=False)

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25
5  26  27  28  29  30
6  31  32  33  34  35
7  36  37  38  39  40
8  41  42  43  44  45
9  46  47  48  49  50

    0   1   2   3   4
9  46  47  48  49  50
8  41  42  43  44  45
7  36  37  38  39  40
6  31  32  33  34  35
5  26  27  28  29  30
4  21  22  23  24  25
3  16  17  18  19  20
2  11  12  13  14  15
1   6   7   8   9  10
0   1   2   3   4   5

In [29]:
# rename
df = df.rename(columns={1:'a'})
print(df)

df = df.rename(index={2:'C'})
print(df)

    0   a   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
C  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25
5  26  27  28  29  30
6  31  32  33  34  35
7  36  37  38  39  40
8  41  42  43  44  45
9  46  47  48  49  50
    0   a   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
C  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25
5  26  27  28  29  30
6  31  32  33  34  35
7  36  37  38  39  40
8  41  42  43  44  45
9  46  47  48  49  50

In [30]:
df.T

   0   1   C   3   4   5   6   7   8   9
0  1   6  11  16  21  26  31  36  41  46
a  2   7  12  17  22  27  32  37  42  47
2  3   8  13  18  23  28  33  38  43  48
3  4   9  14  19  24  29  34  39  44  49
4  5  10  15  20  25  30  35  40  45  50

In [35]:
# concat
df1 = pd.DataFrame(np.full((2,5),1))
df2 = pd.DataFrame(np.arange(1,11).reshape(2,5))
print(df1)
print(df2)

   0  1  2  3  4
0  1  1  1  1  1
1  1  1  1  1  1
   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [37]:
pd.concat([df1,df2],axis=1)

   0  1  2  3  4  0  1  2  3   4
0  1  1  1  1  1  1  2  3  4   5
1  1  1  1  1  1  6  7  8  9  10

In [38]:
# append
df1.append(df2)

   0  1  2  3   4
0  1  1  1  1   1
1  1  1  1  1   1
0  1  2  3  4   5
1  6  7  8  9  10

In [40]:
# drop
print(df1)
df1.drop(1)

   0  1  2  3  4
0  1  1  1  1  1
1  1  1  1  1  1

   0  1  2  3  4
0  1  1  1  1  1

In [41]:
# dropna
df1 = pd.DataFrame(np.full((2,5),1))
df2 = pd.DataFrame(np.arange(1,11).reshape(2,5))
print(df1)
print(df2)

   0  1  2  3  4
0  1  1  1  1  1
1  1  1  1  1  1
   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [43]:
df1.iloc[1,1] = np.nan
print(df1)

   0    1  2  3  4
0  1  1.0  1  1  1
1  1  NaN  1  1  1

In [44]:
df1.dropna()

   0    1  2  3  4
0  1  1.0  1  1  1

In [61]:
df2 = pd.DataFrame(np.arange(1,11).reshape(2,5))
df2 = df2.rename(columns={0:'a',1:'b',2:'c',3:'d',4:'e',5:'f'})
print(df2)

   a  b  c  d   e
0  1  2  3  4   5
1  6  7  8  9  10

In [50]:
# loc
df2.loc[0,'a']

1

In [51]:
# iloc
df2.iloc[1,3]

9

In [62]:
# 헹 선택
df2.iloc[1]

# 조건으로 선택(필터링)
print(df2)
df2 = df2[df2.a > 5]
print(df2)

   a  b  c  d   e
0  1  2  3  4   5
1  6  7  8  9  10
   a  b  c  d   e
1  6  7  8  9  10

In [63]:
# 열 선택
print(df2['b'])

1    7
Name: b, dtype: int32

In [64]:
# csv 파일 읽기 / 쓰기
# csv 쓰기
df2.to_csv('a.csv')

In [65]:
# csv 파일 읽기
df3 = pd.read_csv('a.csv')
print(df3)

   Unnamed: 0  a  b  c  d   e
0           1  6  7  8  9  10